---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.FluidTemperatureSetIterator.CurrentObject
source: html/662481be-f247-cdf9-9b50-e2e65725476e.htm
---
# Autodesk.Revit.DB.Plumbing.FluidTemperatureSetIterator.CurrentObject Property

## Syntax (C#)
```csharp
internal Object CurrentObject { get; }
```